### 2021_09_27_5

In [2]:
import seaborn as sns
import pandas as pd

In [4]:
train = pd.read_csv("./CSV/titanic/train.csv")
test = pd.read_csv("./CSV/titanic/test.csv")

print("train shape :", train.shape)
print("test shape :", test.shape)

train shape : (891, 12)
test shape : (418, 11)

## 데이터 프레임 확인
* [ ].info()
* [ ].dtypes
* [ ].columns
* [ ].shape
* [ ].describe()
* [ ].describe(include = ['O']) : 범주형 데이터

In [6]:
train.describe(include = ["O"])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [7]:
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### Group별 통계
    * groupby()

### Pclass별 Survived 확인

In [9]:
train.groupby(["Pclass"]).count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [12]:
train[["Pclass", "Survived"]].groupby(["Pclass"]).count()

        Survived
Pclass
1            216
2            184
3            491

### SibSp별 생존자 확인(groupby)

In [10]:
train.SibSp.unique()

array([1, 0, 3, 4, 2, 5, 8])

In [11]:
train.groupby(["SibSp"]).count()

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Ticket,Fare,Cabin,Embarked
SibSp,,,,,,,,,,,
0,608,608,608,608,608,471,608,608,608,126,606
1,209,209,209,209,209,183,209,209,209,69,209
2,28,28,28,28,28,25,28,28,28,6,28
3,16,16,16,16,16,12,16,16,16,3,16
4,18,18,18,18,18,18,18,18,18,0,18
5,5,5,5,5,5,5,5,5,5,0,5
8,7,7,7,7,7,0,7,7,7,0,7

In [16]:
train[["SibSp", "Survived"]].groupby(["SibSp"]).count()

       Survived
SibSp
0           608
1           209
2            28
3            16
4            18
5             5
8             7

### SibSp별 Age의 평균 확인(groupby)

In [14]:
train[["SibSp", "Age"]].groupby(["SibSp"]).mean()

             Age
SibSp
0      31.397558
1      30.089727
2      22.620000
3      13.916667
4       7.055556
5      10.200000
8            NaN

In [17]:
train.groupby(["SibSp"]).mean()["Age"]

SibSp
0    31.397558
1    30.089727
2    22.620000
3    13.916667
4     7.055556
5    10.200000
8          NaN
Name: Age, dtype: float64

### Pclass별 나이 연령대

In [22]:
train[["Pclass", "Age"]].groupby(["Pclass"]).mean()

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620